## Plan結果

**Plan: 1 to add, 0 to change, 0 to destroy.**



<details><summary>リソースごとの変更内容の要約はこちら</summary>

```diff

@@ Create @@
+ google_storage_bucket.example_bucket

```

</details>


<details><summary>planの差分詳細はこちら</summary>

```hcl

  # google_storage_bucket.example_bucket will be created
  + resource "google_storage_bucket" "example_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "test-project-373118-sample-bucket"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 30
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>







[GitHub Actions上の実行詳細へのリンク](https://github.com/melanmeg/my-cloudnative-entry/actions/runs/12222786716)

<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":4,"Program":"tfcmt","SHA1":"d13c84ab68af07446515059ce759592731b75c41","Vars":{},"WorkflowName":"terraform-plan"} -->